# ViewDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Camera..::..ViewDirection Property
Camera Class See Also
---
Direction that the camera is facing
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public XYZ ViewDirection { get; set; }
```

Visual Basic
---
```text
Public Property ViewDirection As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ ViewDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace